{
  "Containers": {
    "Docker": [
      {"skill": "Build Custom Images"},
      {"skill": "Optimize custom built images by compressing cached layers."},
      {"skill": "Link Docker containers together."},
      {"skill": "Mount Volumes to docker containers for persistent storage"},
      {"skill": "Expose ports to make available on host machine"},
      {"skill": "Create multiple docker image registry on host machine."}
    ],
    "Kubernetes": [
      {"skill": "Install and configure a kubernetes cluster"}
    ],
    "LXC" : [
      {"skill": "Pull images from ubuntu or canonical's image repository"},
      {"skill": "Start,launch,stop, and delete LXC containers"},
      {"skill": "Install services inside containers and configure network bridge to make availble on host machine."},
      {"skill": "Snapshot images for restoring LXC containers if corrupted."},
      {"skill": "Create remote repository from snapshot images"}
    ],
    "CoreOS": [
      {"skill": "Use pre-built docker containers from docker.hub and use as daemons"},
      {"skill": "Use custom built docker images as daemons"},
      {"skill": "Create and document daemon services"}
    ]
  },
  "Systems" : {
    "Linux" : [
      {"skill" : "Use systemd to create and modify daemon services"},
      {"skill" : "Manage resources and expose ports on a linux machine."},
      {"skill" : "Familiar with encryption software, GPG and PGP for verify and obfuscate files and compressed archives."},
      {"skill" : "Mount file systems and encrypt."}
    ],
    "FreeBSD" : [
      {"skill" : "backup kernels and build custom kernel."},	    
      {"skill" : "using GEOM for partitioning disks and labeling disk devices"},
      {"skill" : "use the ZFS file system for disk administration"},
      {"skill" : "create and configure jails"}
    ],
    "Windows" : [
      {"skill" : "Use powershell and windows bash prompt"},
      {"skill" : "Using server messaging block (SMB) service for Linux and Windows interpolation."}
    ]
  },
  "Security":{
    "Kali": [
      {"skill": "use nmap utility to check open ports on live hosts"},
      {"skill": "using nmap to execute NSE scripts and recollect and archive report"},
      {"skill": "import nmap reports to the metasploit database"},
      {"skill": "using nessus with collaboration with metasploit for vulnerability discovery "},
      {"skill": "familiar with the metasploit framework"}
    ],
    "Tor": [
      {"skill": "install tor on diffrent operating systems. Debian, RPM, and Freebsd. "},
      {"skill": "configure onion services to work on host system"},
      {"skill": "use prop224 to configure next-gen onion services for heightened security "},
      {"skill": "use the tor network as a proxy-chaining to increase anonymity."}
    ]
  }
}
