{
	"Home": {
		"info" : "Open-source is something I am VERY PASSIONATE about. The collection of the world's effort to make modular software accessible to all. This philosphy has motivated me to become familiar with UNIX-based systems. Reason being a majority of eneterprise environments rely on scalable and secure systems to protect against intrusion."
	},
	"Software" : {
		"info" : "Software development allows one to interopolate open-source technology with commercial applications. Leevraging the benefits of pre-compiled libraries to facilitate the task, Computer Science, transfers mathematical concepts to programming applications in pursuit of optimal performance. There are diffrent paradigms in programming to solve problems; such as functional, procedural, imperative,logic ,and reactive.",
		"Javascript": {
		"Frameworks": [{"name":"Express","info":"","doc":""},{"name":"React","info":"","doc":""}],
		"Projects": [{"name": "Web Portfolio", "link": "https://github.com/manguilar22/web", "explain": "A virutal resume for future employeers.","status":"success"},
					 {"name": "Express-React","link":"https://github.com/manguilar22/express-react",
						 "explain":"Express is a javascript framework with great potential. It is used to create RestAPI's and front-end apps. In this project I interpolate diffrent libraries availble in Javascript and using express as the back-end for the routing of content.", "status": "warning"}]
		},
		"Python": {
		"Frameworks": [{"name":"Jupyter","info":"","doc":""},{"name":"Dash","info":"","doc":""}],
		"Projects": [{"name":"Euclidean Distance PY", "link": ".....", "explain": "Algorithm work with the Euclidean Algorithm.","status":"success"},
			         {"name":"Jupyter", "link": ".....", "explain": "Configurations and Setting for the deployment of a jupyter server. This repository purpose is to set up a jupyter server as fast as possible for collaboration efforts","status":"success"}]
		},
		"Java":{
			"Frameworks": [{"name":"Maven","info":"","doc":""},{"name":"Spring","info":"","doc":""}],
			"Projects":[{"name":"....", "link": ".....", "explain": ".....","status":"success"},
				        {"name":"....", "link": ".....", "explain": ".....","status":"success"}]
		},
		"Mathematica": { "info": "....." , "Projects": [{"name":"...."}]}
	}
}
