{
	"Home": {
		"info" : "Open-source is something I am VERY PASSIONATE about. The collection of the world's effort to make modular software accessible to all. This philosophy has motivated me to become familiar with UNIX-based systems. Reason being a majority of eneterprise environments rely on scalable and secure systems to protect against intrusion."
	},
	"Software" : {
		"info" : "Software development allows one to interpolate open-source technology with commercial applications. Leevraging the benefits of pre-compiled libraries to facilitate the task, Computer Science, transfers mathematical concepts to programming applications in pursuit of optimal performance. There are diffrent paradigms in programming to solve problems; such as functional, procedural, imperative,logic ,and reactive.",
		"Javascript": {
		"Frameworks": [{"name":"Express","info":"","doc":""},{"name":"React","info":"","doc":""}],
		"Projects": [
			{"name": "Web Portfolio", "status":"success","link": "https://github.com/manguilar22/web",
				"explain": "A virtual resume for future employers."},
			{"name": "Express-React","link":"https://github.com/manguilar22/express-react","status": "warning",
				"explain":"Express is a javascript framework with great potential. It is used to create RestAPI's and front-end apps. In this project I interpolate diffrent libraries availble in Javascript and using express as the back-end for the routing of content."}
		]},
		"Python": {
		"Frameworks": [{"name":"Jupyter","info":"","doc":""},{"name":"Dash","info":"","doc":""}],
		"Projects": [
			{"name":"Euclidean Distance PY","status":"success", "link": "https://github.com/manguilar22/EuclideanDistancePY",
				"explain": "Using the euclidean algorithm on a self-made registry of hospitals in El Paso, Texas. Also using a dataset of 530,000 hospital around the world."},
			{"name":"Scientific Computing", "link": "https://github.com/manguilar22/ScientificComputing","status": "danger",
				"explain": "A collection of notebooks focused on numerical computing. Also using visualizations to demonstrate topological figures."},
			{"name":"Jupyter", "link": "https://github.com/manguilar22/jupyter","status":"success",
				"explain": "Configurations and Setting for the deployment of a jupyter server. This repository purpose is to set up a jupyter server as fast as possible for collaboration efforts"},
			{"name":"FinancePython","link":"https://github.com/manguilar22/FinancePython","status":"danger",
					 "explain":"Financial Analysis of a collection of stocks"}
		]},
		"Java":{
			"Frameworks": [{"name":"Maven","info":"","doc":""},{"name":"Spring","info":"","doc":""}],
			"Projects":[
				{"name":"FinanceSpring", "link": "https://github.com/manguilar22/FinanceSpring","status":"warning",
					"explain": "Using spring to make a collection of stocks with built-in data structures."}
			]},
		"Mathematica": { "info": "....." ,
			"Projects": [
				{"name":"Cryptosystems & Hash Functions","link":"https://github.com/manguilar22/DiscreteMath","status":"success",
					"explain": "A project I did for my discrete math class. Highlighting diffrent cryptosystems and hash function entropy."},
				{"name":"Learn Mathematica","link":"https://github.com/manguilar22/Mathematica","status":"warning",
					"explain":"An encyclopedic collection of Mathematica's functions and there usage."}
			]
		}
	}
}
